import { PageTitle } from "../components/PageTitle";
import Photo from "/photo.jpg";

export const About = () => {
  return (
    <div>
      <PageTitle title="About" />
      <img className="rounded-full" src={Photo} alt="photo" />
      <p>
        Завдяки фронтенду тепер я швидше вчуся! За перші півроку навчання я
        поклав у свою голову, здається більше ніж, ніж за роки у ВИШі! І, думаю,
        тут інакше і не можна - інформації дуже багато!
      </p>
      <p>
        Для мене розробка React проектів - справжнє задоволення! Це набагато
        цікавіше нового серіалу чи 'зависання' в YouTube. Раніше я захоплювався
        обробкою зображень в Adobe Photoshop або написанням формул в Microsoft
        Excel. Але тут все наче поєдналося воєдине!
      </p>
      <p>
        Саме тому власні проекти я починаю з пошуку ідей дизайну. Потім або
        роблю макет в Figma або одразу розбираю все на компоненти. Малюю
        необхідні svg в Illustrator. Завдяки Tailwind компоненти швиденько
        фарбуються і оживають...
      </p>
      <p>
        Ну і, якщо проект складний саме за логікою - краще все розписати на
        звичайному шматку паперу...
      </p>
      <p>
        Фронтенд - це креатив, який одразу бачиш очима... Я вдячний проклятій
        війні, через яку я познайомився з цим направленням IT.
      </p>
      <p>
        Я не знаю як закінчиться моє навчання, проте я ні краплі не пожалкував,
        що вивчив цей напрямок.
      </p>
    </div>
  );
};
